0_demo_TurbulentCombustion/openfoam/cylinder2d/case_template/constant/momentumTransport
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      momentumTransport;
}

simulationType  laminar;
