0_demo_TurbulentCombustion/openfoam/cylinder2d/case_template/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

transportModel  Newtonian;

// nu = U_inf * D / Re = 1 / Re; run_case.sh substitutes NU_VALUE
nu              [0 2 -1 0 0 0 0] NU_VALUE;
