0_demo_TurbulentCombustion/openfoam/cylinder2d/case_template/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  2D circular cylinder, full O-grid ring embedded in a rectangular domain.
  Nondimensional: D = 1 (r = 0.5), U_inf = 1. Domain x [-8, 25], y [-8, 8].
  12 blocks: 4 O-ring quadrants (radial grading to the wall) + wake band +
  top/bottom/left bands + 4 corners. Front/back = defaultPatch empty (2D).
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

// 2D vertex table (z extruded -0.05 -> 0.05):
//  0-3  inner ring (cylinder, r=0.5, diagonals)   4-7  outer ring square (+-2)
//  8-9  wake band right corners (25, -+2)         10-13 top row (t1 t2 tr tl)
// 14-15 left band (l2 l3)                         16-19 bottom row (b0 b3 br bl)
vertices
(
    ( 0.35355339 -0.35355339 -0.05)  // 0  i0
    ( 0.35355339  0.35355339 -0.05)  // 1  i1
    (-0.35355339  0.35355339 -0.05)  // 2  i2
    (-0.35355339 -0.35355339 -0.05)  // 3  i3
    ( 2 -2 -0.05)                    // 4  o0
    ( 2  2 -0.05)                    // 5  o1
    (-2  2 -0.05)                    // 6  o2
    (-2 -2 -0.05)                    // 7  o3
    (25 -2 -0.05)                    // 8  d0
    (25  2 -0.05)                    // 9  d1
    ( 2  8 -0.05)                    // 10 t1
    (-2  8 -0.05)                    // 11 t2
    (25  8 -0.05)                    // 12 tr
    (-8  8 -0.05)                    // 13 tl
    (-8  2 -0.05)                    // 14 l2
    (-8 -2 -0.05)                    // 15 l3
    ( 2 -8 -0.05)                    // 16 b0
    (-2 -8 -0.05)                    // 17 b3
    (25 -8 -0.05)                    // 18 br
    (-8 -8 -0.05)                    // 19 bl

    ( 0.35355339 -0.35355339  0.05)  // 20
    ( 0.35355339  0.35355339  0.05)  // 21
    (-0.35355339  0.35355339  0.05)  // 22
    (-0.35355339 -0.35355339  0.05)  // 23
    ( 2 -2  0.05)                    // 24
    ( 2  2  0.05)                    // 25
    (-2  2  0.05)                    // 26
    (-2 -2  0.05)                    // 27
    (25 -2  0.05)                    // 28
    (25  2  0.05)                    // 29
    ( 2  8  0.05)                    // 30
    (-2  8  0.05)                    // 31
    (25  8  0.05)                    // 32
    (-8  8  0.05)                    // 33
    (-8  2  0.05)                    // 34
    (-8 -2  0.05)                    // 35
    ( 2 -8  0.05)                    // 36
    (-2 -8  0.05)                    // 37
    (25 -8  0.05)                    // 38
    (-8 -8  0.05)                    // 39
);

blocks
(
    // O-ring quadrants: local x radial (inner->outer, expansion 8), 40x40
    hex ( 0  4  5  1 20 24 25 21) (40 40 1) simpleGrading (8 1 1)      // east
    hex ( 1  5  6  2 21 25 26 22) (40 40 1) simpleGrading (8 1 1)      // north
    hex ( 2  6  7  3 22 26 27 23) (40 40 1) simpleGrading (8 1 1)      // west
    hex ( 3  7  4  0 23 27 24 20) (40 40 1) simpleGrading (8 1 1)      // south

    hex ( 4  8  9  5 24 28 29 25) (120 40 1) simpleGrading (4 1 1)     // wake band
    hex ( 6  5 10 11 26 25 30 31) (40 30 1) simpleGrading (1 4 1)      // top band
    hex (15  7  6 14 35 27 26 34) (30 40 1) simpleGrading (0.25 1 1)   // left band
    hex (17 16  4  7 37 36 24 27) (40 30 1) simpleGrading (1 0.25 1)   // bottom band

    hex ( 5  9 12 10 25 29 32 30) (120 30 1) simpleGrading (4 4 1)     // top-right
    hex (14  6 11 13 34 26 31 33) (30 30 1) simpleGrading (0.25 4 1)   // top-left
    hex (16 18  8  4 36 38 28 24) (120 30 1) simpleGrading (4 0.25 1)  // bottom-right
    hex (19 17  7 15 39 37 27 35) (30 30 1) simpleGrading (0.25 0.25 1)// bottom-left
);

edges
(
    arc  0  1 ( 0.5  0   -0.05)
    arc  1  2 ( 0    0.5 -0.05)
    arc  2  3 (-0.5  0   -0.05)
    arc  3  0 ( 0   -0.5 -0.05)
    arc 20 21 ( 0.5  0    0.05)
    arc 21 22 ( 0    0.5  0.05)
    arc 22 23 (-0.5  0    0.05)
    arc 23 20 ( 0   -0.5  0.05)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (14 34 33 13)
            (15 35 34 14)
            (19 39 35 15)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            ( 9 12 32 29)
            ( 8  9 29 28)
            (18  8 28 38)
        );
    }
    top
    {
        type symmetryPlane;
        faces
        (
            (13 33 31 11)
            (11 31 30 10)
            (10 30 32 12)
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (19 17 37 39)
            (17 16 36 37)
            (16 18 38 36)
        );
    }
    cylinder
    {
        type wall;
        faces
        (
            ( 0  1 21 20)
            ( 1  2 22 21)
            ( 2  3 23 22)
            ( 3  0 20 23)
        );
    }
);

defaultPatch
{
    name frontAndBack;
    type empty;
}
